### Terraform Plan 📖
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_db_instance.postgresql will be created
  + resource "aws_db_instance" "postgresql" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "devops_dashboard"
      + db_subnet_group_name                  = "devops-dashboard-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "17.2"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = "devops-dashboard-final-snapshot"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = true
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags                                  = {
          + "Name" = "devops-dashboard-db"
        }
      + tags_all                              = {
          + "Name" = "devops-dashboard-db"
        }
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = [
          + "sg-018f9c99579d7a773",
        ]
    }

  # aws_eks_addon.coredns will be created
  + resource "aws_eks_addon" "coredns" {
      + addon_name                  = "coredns"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "my-eks-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # aws_eks_addon.kube_proxy will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name                  = "kube-proxy"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "my-eks-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # aws_eks_addon.vpc_cni will be created
  + resource "aws_eks_addon" "vpc_cni" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "my-eks-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # aws_eks_cluster.eks_cluster will be created
  + resource "aws_eks_cluster" "eks_cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "my-eks-cluster"
      + platform_version              = (known after apply)
      + role_arn                      = "arn:aws:iam::054183072250:role/eks-service-role"
      + status                        = (known after apply)
      + tags_all                      = (known after apply)
      + version                       = (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = [
              + "subnet-0a7f3b2ecd7afce18",
              + "subnet-0d772d2e9881754f8",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_cluster.example will be destroyed
  # (because aws_eks_cluster.example is not in configuration)
  - resource "aws_eks_cluster" "example" {
      - arn                           = "arn:aws:eks:us-west-2:054183072250:cluster/my-eks-cluster" -> null
      - bootstrap_self_managed_addons = true -> null
      - certificate_authority         = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJWWdQSXl2MnVvNTh3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TlRBek16QXdORE15TXpaYUZ3MHpOVEF6TWpnd05ETTNNelphTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUN5TWllMGs0VUdwbmJycFdvdHUyOThmUDkrejlIWjhoT0Y3UTh5UUdxb0pTdkJoN2phdC9TY1NHRkUKeWZaSFNCendRbVR1MmkwT2lyYW9LZDc5ZUZHVU84VmZCZHFBeXJ4bW1yZ2lSNWtXUjBRdkFBQVVyYkRmYnEzbQp5bW9wVCttYmY3Z25jVnFDWFJZZk1tUHZ0eXRCSUMxT25ucWYzSEE3cHRSOGZEbEpXeVFPVGkyRVRma3JKb0JVCnZjZmR1cC9GM3VLK0RmblREUHVNeTgwUklScGt6emM4M2ZOR1FrV0JSVHFKNi9MbjFyczFQdnpVVFMxZU1kWHoKcFArd2dhNVN5aGlrWjZ0ZjFXUWgxYnNYL0gxcmNibUsrRXdlZ3hPRWNhUmF4OERKZlNRODZXd1hRSGR1eXlRMQo3VEhYOS9ZS05zMWxWK0pCUGkrYUp1Y012c3V2QWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRbzZ6a2dlYVBUUVRBWHVXaFBlSUwxZzRCbmpqQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQTF6Ym5yeklhQwpQaGZsUk5ka2pzR0hmanRaRTlPMWRGMG02UkQ5aFRrVmpueXE4ejExMG1lbHVhRTJ2Qm1XSVRtYzBjWnV0cFkwCmlpdG1YRUZhVk5vazF6eWtXRmxFZmZHeTJxaGdhVDJyT0dPcitWZ2JUWk5lRko2Qkx4R09wNjNnT0MyUU90STUKZk1ZTzViOFlWUFppcGJ5ZUJJTk5HTitnYkpSMExxMEJGd0g5SFEyQWxpc2Q3c2E4WWQzOWZMNWtMNTg5UFdtWgpVV1B4NU1XVnhpUXpyTHRyeEh1Rll0a0w3Q1V1WTJaanF2TWh3aFBYTWYydEx4QTR1SjJURWFRU1VxOFBpUEdsClBlTk5kTWtrMDNKWTJySENDUUJQcGhlMGtaQlFuOEhrcDV6cUV2VTBhcVhuTVkrSUk4ZXYrdC8yTVlkQlo1NGYKcmFTdXpiZE15d05rCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> null
      - created_at                    = "2025-03-30T04:32:55Z" -> null
      - enabled_cluster_log_types     = [] -> null
      - endpoint                      = "https://06BE24C4A1B78AF55B192DB94328964B.gr7.us-west-2.eks.amazonaws.com" -> null
      - id                            = "my-eks-cluster" -> null
      - identity                      = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-west-2.amazonaws.com/id/06BE24C4A1B78AF55B192DB94328964B"
                    },
                ]
            },
        ] -> null
      - name                          = "my-eks-cluster" -> null
      - platform_version              = "eks.5" -> null
      - role_arn                      = "arn:aws:iam::054183072250:role/eks-service-role" -> null
      - status                        = "ACTIVE" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
      - version                       = "1.32" -> null

      - access_config {
          - authentication_mode                         = "CONFIG_MAP" -> null
          - bootstrap_cluster_creator_admin_permissions = true -> null
        }

      - kubernetes_network_config {
          - ip_family         = "ipv4" -> null
          - service_ipv4_cidr = "172.20.0.0/16" -> null

          - elastic_load_balancing {
              - enabled = false -> null
            }
        }

      - upgrade_policy {
          - support_type = "EXTENDED" -> null
        }

      - vpc_config {
          - cluster_security_group_id = "sg-00156b0dc8c851d2c" -> null
          - endpoint_private_access   = false -> null
          - endpoint_public_access    = true -> null
          - public_access_cidrs       = [
              - "0.0.0.0/0",
            ] -> null
          - security_group_ids        = [] -> null
          - subnet_ids                = [
              - "subnet-0a7f3b2ecd7afce18",
              - "subnet-0d772d2e9881754f8",
            ] -> null
          - vpc_id                    = "vpc-06c3dcacfa552bd07" -> null
        }
    }

  # aws_eks_node_group.example is tainted, so must be replaced
-/+ resource "aws_eks_node_group" "example" {
      ~ ami_type               = "AL2023_x86_64_STANDARD" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-west-2:054183072250:nodegroup/my-eks-cluster/example-node-group/c8caf2bf-4606-6fef-5e0c-7712c201ad6e" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "my-eks-cluster:example-node-group" -> (known after apply)
      ~ instance_types         = [
          - "t3.medium",
        ] -> (known after apply)
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.32.1-20250317" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-example-node-group-c8caf2bf-4606-6fef-5e0c-7712c201ad6e"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ version                = "1.32" -> (known after apply)
        # (4 unchanged attributes hidden)

      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }

        # (1 unchanged block hidden)
    }

  # aws_iam_role_policy_attachment.eks_cni_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cni_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-node-role"
    }

  # aws_iam_role_policy_attachment.eks_registry_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_registry_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-node-role"
    }

Plan: 8 to add, 0 to change, 2 to destroy.
```